** code block
   src block:     <s TAB
   native editor: C-c '
#+BEGIN_SRC emacs-lisp -n -r
  (+ 10 5)
#+END_SRC
#+BEGIN_SRC go
  package main

  import "fmt"

  func main() {
      sayHi()
  }

  func sayHi() {
      fmt.Println("hello, world")
  }
#+END_SRC

#+BEGIN_SRC python
  print "hello, world"
#+END_SRC

#+RESULTS:
: None

#+BEGIN_SRC sql
SELECT * from stuff where thing = 'a';
#+END_SRC

#+begin_src go
  package  main
  import "fmt"
  func main() {
	  x := 3
	  y := 4

	  //swap without temp var
	  x = x ^ y
	  y = x ^ y
	  x = x ^ y
	  fmt.Printf("x: %d, y: %d\n", x, y)
  }

#+END_SRC

#+RESULTS:
: x: 4, y: 3
(hit C-c ' to edit in go-mode buffer)


#+BEGIN_SRC python
    m = 1.6726231e-27 #kg
    c = 3.0e
#+END_SRC

#+RESULTS:
: None

#+BEGIN_SRC artist
    +------------------------+
    | hi                     |
    |                        |
    +------------------------+
#+END_SRC

#+BEGIN_SRC calc :var x=5 :var y=2
2+a*x**y
#+END_SRC

#+RESULTS:
: 25 a + 2

#+BEGIN_SRC calc :exports both
fsolve(x*2+x=4,x)
#+END_SRC

#+RESULTS:
: x = 1.33333333333

*** kitchen sink
    $  means column
    @  means row
    @> means last row
|  x |  y | z      |    |
|----+----+--------+----|
|  1 |  1 | hi     |  2 |
|  2 |  4 | there! |  6 |
|  3 |  9 |        | 12 |
|  4 | 16 |        | 20 |
|  5 | 25 |        | 30 |
|  6 | 36 |        | 42 |
|  7 | 49 |        | 56 |
|----+----+--------+----|
| 28 | 20 |        |    |
#+TBLFM: @>$1=vsum(@2..@-1)::@>$2=vmean(@2..@-1)::$2=$1^2::@3$3=there!
#+TBLFM: @2$4..@-1$4=$1+$2
(hit C-c C-c to calculate)

*** reference 2nd table
#+name: costs
| class      | on demand |  1 yr |  3 yr |
|------------+-----------+-------+-------|
| t2 small*  |     0.036 | 0.024 | 0.017 |
| m5 x-large |     0.356 | 0.213 | 0.143 |

| class      | memory (GiB) | max connections | on demand |   1 yr |   3 yr |
|------------+--------------+-----------------+-----------+--------+--------|
| t2 small*  |            2 |           225.0 |     25.92 |  17.28 |  12.24 |
| m5 x-large |           16 |          1802.0 |    256.32 | 153.36 | 102.96 |
#+TBLFM: $3='(min (fround (/ (* $2 1073741824.0) 9531392.0)) 5000.0);N
#+TBLFM: @2$4..@$4=remote(costs,@@#$2)*24.0*30.0
#+TBLFM: @2$5..@$5=remote(costs,@@#$3)*24.0*30.0
#+TBLFM: @2$6..@$6=remote(costs,@@#$4)*24.0*30.0

| service            | estimate |
|--------------------+----------|
| tiles              |    40000 |
| address suggestion |    10000 |
| geo                |    10000 |
| reverse geo        |   100000 |

| aws                                         | price ($) | quantity | estimate ($/year) |
|---------------------------------------------+-----------+----------+-------------------|
| Map tiles retrieved (Vector or Raster)      |      0.04 |     1000 |                4. |
| Address suggestion requests                 |      0.20 |     1000 |               20. |
| Addresses geocoded (stored results)         |      4.00 |     1000 |              400. |
| Positions reverse-geocoded (stored results) |      4.00 |     1000 |              400. |
|---------------------------------------------+-----------+----------+-------------------|
| total                                       |           |          |              824. |
#+TBLFM: @2$4..@-1$4=($2/$3)*remote(usage,@>$2)
#+TBLFM: @6$4=vsum(@2..@-1)

|---------------------------------------------+-----------+----------+-------------------+--------------------------|
| mapbox                                      | price ($) | quantity | estimate ($/year) | notes                    |
|---------------------------------------------+-----------+----------+-------------------+--------------------------|
| Map tiles retrieved (Vector)                |      0.25 |     1000 |                 0 | after 200k free requests |
| Address suggestion requests                 |      0.75 |     1000 |                 0 | after 100k free requests |
| Addresses geocoded (stored results)         |      5.00 |     1000 |              500. |                          |
| Positions reverse-geocoded (stored results) |      5.00 |     1000 |              500. |                          |
|---------------------------------------------+-----------+----------+-------------------+--------------------------|
| total                                       |           |          |             1000. |                          |
#+TBLFM: @2$4..@-1$4=($2/$3)*remote(usage,@>$2)
#+TBLFM: @6$4=vsum(@2..@-1)

*** lisp
| x | y |  z |
|---+---+----|
| 1 | 2 |  3 |
| 2 | 4 |  6 |
| 3 | 6 |  9 |
| 4 | 8 | 12 |
#+TBLFM: $3='(+ $1 $2);N
;N tells lisp that the args are numeric

#+name: fibbd
#+begin_src emacs-lisp :var n=0
(defun fibbd (n) (if (< n 2) 1 (+ (fibbd (- n 1)) (fibbd (- n 2)))))
(fibbd n)
#+end_src

| original | fibbd |
|----------+-------|
|        0 |     1 |
|        1 |     1 |
|        2 |     2 |
|        3 |     3 |
|        4 |     5 |
|        5 |     8 |
|        6 |    13 |
|        7 |    21 |
|        8 |    34 |
|        9 |    55 |
#+TBLFM: $2='(org-sbe fibbd (n $1))

*** Multile formulas 
| a |  b | sum |
|---+----+-----|
| 1 |  2 |   9 |
| 2 |  4 |  36 |
| 3 |  6 |  81 |
| 4 |  8 | 144 |
| 5 | 10 | 225 |
#+TBLFM: $2=$1+$1
#+TBLFM: $3=($1+$2)^2

|  a |  b | sum |
|----+----+-----|
|  1 |  2 |   9 |
|  2 |  4 |  36 |
|  3 |  6 |  81 |
|  4 |  8 | 144 |
|  5 | 10 | 225 |
|----+----+-----|
| 15 | 30 | 486 |
#+TBLFM: $2=$1+$1::$3=($1+$2)^2
#+TBLFM: @>$3=vsum(@2..@-1)
#+TBLFM: @>$2=vsum(@2..@-1)
#+TBLFM: @>$1=vsum(@2..@-1)

*** use python
| airmass | zenith_seeing | delivered_seeing |
|---------+---------------+------------------|
|     1.3 |          0.96 |        1.1236660 |
|     1.3 |           1.0 |        1.1704854 |
|     1.3 |           1.1 |        1.2875340 |
|     1.3 |           1.2 |        1.4045825 |
|     1.3 |          1.25 |        1.4631068 |
|     1.3 |           1.3 |        1.5216311 |
|     1.3 |           1.5 |        1.7557281 |
|     1.3 |           1.8 |        2.1068738 |
|     1.2 |           1.8 |        2.0080811 |
|     1.3 |           2.0 |        2.3409709 |
|     1.3 |           2.5 |        2.9262136 |
#+TBLFM: $3=$2*($1**0.6)

#+NAME: sampformula
#+BEGIN_SRC python :var angle=90 :var r=2 :exports none
from math import radians, cos
result = r*cos(radians(angle))*2
return result
#+END_SRC

| angle |  r |             x |
|-------+----+---------------|
|    30 | 10 | 17.3205080757 |
|    45 | 10 | 14.1421356237 |
|    60 | 10 |          10.0 |
#+TBLFM: $3='(org-sbe "sampformula" (angle $1) (r $2))

**** with int vars
#+name: goexample
#+begin_src go :var x=0 :results output :imports '("fmt") 
  fmt.Println(x*x)
#+end_src
| a |  b |
|---+----|
| 1 |  1 |
| 2 |  4 |
| 3 |  9 |
| 4 | 16 |
#+TBLFM: $2='(org-sbe goexample (x $1))
